# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [21]:
import pandas as pd

import matplotlib.pyplot as plt

import os

# Schetsen

In [117]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    },
)

# Standaard print
print(df)

# Vergelijk met
display(df)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [98]:
# Data opslaan
os.getcwd()
df.to_csv('../csv/titanic_test.csv', header = True, index = False)

csv_file = pd.read_csv('../csv/titanic_test.csv')

display(csv_file)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [99]:
# Data inlezen
csv_file = pd.read_csv('../csv/titanic_test.csv')

display(csv_file)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [100]:
# De kolomnaam
df.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [101]:
# Een kolom lezen
df.Age
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [82]:
# Een kolom verwijderen

col = df.pop('Age')

display(age_var)
display(df)

0    22
1    35
2    58
Name: Age, dtype: int64

In [96]:
df_copy = df.copy()

df_copy.drop('Age', axis = 1)

                       Name     Sex
0   Braund, Mr. Owen Harris    male
1  Allen, Mr. William Henry    male
2  Bonnell, Miss. Elizabeth  female

In [110]:
# Een rij lezen
# ...
df.iloc[0, 1]

22

In [119]:
# Functie getRow() maken
# ...
def getRow(df, index):
    return df.iloc[index]

getRow(df, 1)

Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object

In [124]:
# Een rij toevoegen
# ...
df_copy_2 = df.copy()

df_copy.loc[3] = ['Danny', 29, 'male']

display(df_copy)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
3                     Danny   29    male

In [133]:
# Functie insertAt(row, index)
# ...

In [130]:
# Verkennen
# ...
df_copy.tail()

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female
3                     Danny   29    male

In [139]:
# Filteren
df.query("Age > 30 and Sex == 'male'")

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male

In [147]:
df[df['Name'].str.contains('Bonnell')].index

Int64Index([2], dtype='int64')

In [136]:
# Groeperen
# ...

In [137]:
# Extra: toepassing OOP en het bouwen van je eigen library
# ...